from pydantic import BaseModel
from enum import Enum
from typing import Dict, List

from random import choice

from fastapi import APIRouter

router = APIRouter(tags=["Цитаты"])


# модель ответа о чётности числа
class QuoteData(BaseModel):
    text: str
    author: str


class QuoteTheme(str, Enum):
    phys = "phys"
    math = "math"
    inf = "inf"


quotes_data: Dict[str, List[QuoteData]] = {
    "phys": [
        {"text": "Физика — это наука понимать природу.", "author": "Эрик Роджерс"},
        {
            "text": "Если вы учёный, квантовый физик, и не можете в двух словах объяснить пятилетнему ребёнку, чем вы занимаетесь, — вы шарлатан.",
            "author": "Ричард Фейнман",
        },
        {"text": "Бог не играет в кости.", "author": "Альберт Эйнштейн"},
        {
            "text": "Физик стремится сделать сложные вещи простыми, а поэт – простые вещи – сложными",
            "author": "Николай Тесла",
        },
        {
            "text": "Ученый-физик – это способ атома взглянуть на самого себя.",
            "author": "Лев Ландау",
        },
    ],
    "math": [
        {
            "text": "Математика — это язык, на котором написана книга природы.",
            "author": "Галилео Галилей",
        },
        {
            "text": "Если люди не верят, что математика проста, то только потому, что они не осознают, насколько сложна жизнь.",
            "author": "Джон фон Нейман",
        },
        {
            "text": "Чистая математика — это своего рода поэзия логических идей.",
            "author": "Альберт Эйнштейн",
        },
        {
            "text": "Математика — это наука, которая не может быть понята без практики.",
            "author": "Леонард Эйлер",
        },
        {
            "text": "Математика — это не просто наука, это искусство.",
            "author": "Поль Дирак",
        },
    ],
    "inf": [
        {"text": "Код легче писать, чем читать.", "author": "Джоэл Спольски"},
        {
            "text": "Программирование — это искусство, а не наука.",
            "author": "Дональд Кнут",
        },
        {
            "text": "Программисты — это люди, которые решают проблемы, которые не существовали до их появления.",
            "author": "Билл Гейтс",
        },
        {
            "text": "Программы должны писаться для людей, которые будут их читать.",
            "author": "Харольд Абельсон",
        },
        {
            "text": "Программирование — это не просто работа, это стиль жизни.",
            "author": "Мартин Фаулер",
        },
    ],
}


@router.get(
    "/quote/{theme}",
    response_model=QuoteData,
    summary="Получить случайную цитату",
    description="Возвращает цитату по одной из тем: физика, математика или информатика",
)
async def get_quote(theme: QuoteTheme):
    return choice(quotes_data.get(theme, []))
